Hi!

I'm seeing this behaviour too when attempting to upgrade from 3.94.0 to 3.97.1 (never used/tried 3.97.0):

Plan snippet:
```
  # module.hub["westeurope"].azurerm_storage_account.nw must be replaced
-/+ resource "azurerm_storage_account" "nw" {
      ~ access_tier                        = "Hot" -> (known after apply)
      + dns_endpoint_type                  = "Standard" # forces replacement
      ~ id                                 = "/subscriptions/11111111-900a-46fa-a0d9-111111111111/resourceGroups/rg-app-hub-stg-we/providers/Microsoft.Storage/storageAccounts/stappnwstgwe" -> (known after apply)
      + large_file_share_enabled           = (known after apply)
        name                               = "stappnwstgwe"

(...)
```

Code snippets:

```
module "hub" {
  source = "../modules/hub"

  for_each = { for cfg in module.var.conf_by_app.app : cfg.location => cfg }

  application     = each.value.app
  environment     = each.value.environment
  location        = each.key
  address_space   = each.value.address_space
  resource_groups = module.sb.azurerm_resource_group
```

../modules/hub:
```
resource "azurerm_storage_account" "nw" {
  name                = "st${var.application}nw${var.environment}${local.location_table[var.location]}"
  location            = var.location
  resource_group_name = var.resource_groups["${local.module_name}-${local.location_table[var.location]}"].name

  account_tier                     = "Standard"
  account_replication_type         = "LRS"
  allow_nested_items_to_be_public  = false
  cross_tenant_replication_enabled = false
  min_tls_version                  = "TLS1_2"

  lifecycle { ignore_changes = [tags] }
}
```

